iarsystems/ewarm-toshiba-example-projects/TMPM4GQ/Libraries/TMPM4GQ.h
/** Processor and Core Peripheral Section */

/* Configuration of the Cortex-M4 Processor and Core Peripherals */
#define __CM4_REV 0x0001 /*!< Cortex-M4 Core Revision */
#define __MPU_PRESENT 1 /*!< MPU present or not */
#define __FPU_PRESENT 1 /*!< FPU present or not */
#define __NVIC_PRIO_BITS 4 /*!< Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig 0 /*!< Set to 1 if different SysTick Config is used */
/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm4.h"                       /* Cortex-M4 processor and core peripherals            */
#include "system_TMPM4Gx.h"                 /* TMPM4Gx System                                      */

/** @addtogroup Device_Peripheral_registers
  * @{
  */

/** Device Specific Peripheral registers structures */

/**
  * @brief DMA Controller
  */
typedef struct
{
  __I  uint32_t INTSTATUS;         /*!< DMAC Interrupt Status Register               */
  __I  uint32_t INTTCSTATUS;       /*!< DMAC Transfer Completion Interrupt Status Register*/
  __O  uint32_t INTTCCLEAR;        /*!< DMAC Transfer Completion Interrupt Clear Register*/
  __I  uint32_t INTERRORSTATUS;    /*!< DMAC Error Interrupt Status Register         */
  __O  uint32_t INTERRCLR;         /*!< DMAC Error Interrupt Clear Register          */
  __I  uint32_t RAWINTTCSTATUS;    /*!< DMAC Raw Transfer Completion Interrupt Status Register*/
  __I  uint32_t RAWINTERRORSTATUS; /*!< DMAC Raw Error Interrupt Status Register     */
  __I  uint32_t ENBLDCHNS;         /*!< DMAC Channel Enable Register                 */
  __IO uint32_t SOFTBREQ;          /*!< DMAC Software Burst Transfer Request Register*/
  __IO uint32_t SOFTSREQ;          /*!< DMAC Software Single Transfer Request Register*/
       uint32_t RESERVED0[2];
  __IO uint32_t CONFIGURATION;     /*!< DMAC Configuration Register                  */
       uint32_t RESERVED1[51];
  __IO uint32_t C0SRCADDR;         /*!< DMAC Channel 0 Transfer Source Address Register*/
  __IO uint32_t C0DESTADDR;        /*!< DMAC Channel 0 Transfer Destination Address Register*/
  __IO uint32_t C0LLI;             /*!< DMAC Channel 0 Linked List Item Register     */
  __IO uint32_t C0CONTROL;         /*!< DMAC Channel 0 Control Register              */
  __IO uint32_t C0CONFIGURATION;   /*!< DMAC Channel 0 Configuration Register        */
       uint32_t RESERVED2[3];
  __IO uint32_t C1SRCADDR;         /*!< DMAC Channel 1 Transfer Source Address Register*/
  __IO uint32_t C1DESTADDR;        /*!< DMAC Channel 1 Transfer Destination Address Register*/
  __IO uint32_t C1LLI;             /*!< DMAC Channel 1 Linked List Item Register     */
  __IO uint32_t C1CONTROL;         /*!< DMAC Channel 1 Control Register              */
  __IO uint32_t C1CONFIGURATION;   /*!< DMAC Channel 1 Configuration Register        */
} TSB_DMAC_TypeDef;

/**
  * @brief SMIF
  */
typedef struct
{
  __IO uint32_t MAP0;              /*!< SMIF Address Map Control Register 0          */
  __IO uint32_t MAP1;              /*!< SMIF Address Map Control Register 1          */
  __IO uint32_t DACR0;             /*!< SMIF Direct Access Control Register 0        */
  __IO uint32_t DACR1;             /*!< SMIF Direct Access Control Register 1        */
  __IO uint32_t DRCR0;             /*!< SMIF Direct Read Control Register 0          */
  __IO uint32_t DRCR1;             /*!< SMIF Direct Read Control Register 1          */
  __IO uint32_t DWCR0;             /*!< SMIF Direct Write Control Register 0         */
  __IO uint32_t DWCR1;             /*!< SMIF Direct Write Control Register 1         */
       uint32_t RESERVED0[248];
  __IO uint32_t RACR0;             /*!< SMIF Indirect Access Control Register 0      */
  __IO uint32_t RACR1;             /*!< SMIF Indirect Access Control Register 1      */
  __IO uint32_t IOCR;              /*!< SMIF Indirect Access I/O Control Register    */
  __IO uint32_t OECR;              /*!< SMIF  Indirect Access Output Enable Register */
       uint32_t RESERVED1[12];
  __IO uint32_t INT;               /*!< SMIF Interrupt Control Register              */
  __IO uint32_t STAT;              /*!< SMIF Status Register                         */
       uint32_t RESERVED2[14];
  __IO uint32_t SWR;               /*!< SMIF Software Reset Register                 */
  __IO uint32_t ACKR;              /*!< SMIF Additional Clock Control Register       */
  __IO uint32_t CCOR;              /*!< SMIF Serial Clock, CS pin Direction Control Register*/
  __IO uint32_t STPR;              /*!< SMIF Forced Stop Control Register            */
       uint32_t RESERVED3[28];
  __IO uint32_t PBUF0;             /*!< SMIF  Indirect Access Primary Buffer Register 0*/
  __IO uint32_t PBUF1;             /*!< SMIF Indirect Access Primary Buffer Register 1*/
  __IO uint32_t PBUF2;             /*!< SMIF Indirect Access Primary Buffer Register 2*/
  __IO uint32_t PBUF3;             /*!< SMIF Indirect Access Primary Buffer Register 3*/
  __IO uint32_t PBUF4;             /*!< SMIF Indirect Access Primary Buffer Register 4*/
  __IO uint32_t PBUF5;             /*!< SMIF Indirect Access Primary Buffer Register 5*/
  __IO uint32_t PBUF6;             /*!< SMIF Indirect Access Primary Buffer Register 6*/
  __IO uint32_t PBUF7;             /*!< SMIF Indirect Access Primary Buffer Register 7*/
       uint32_t RESERVED4[56];
  __IO uint32_t SBUF00;            /*!< SMIF Indirect Access Secondary Buffer Register 00*/
  __IO uint32_t SBUF01;            /*!< SMIF Indirect Access Secondary Buffer Register 01*/
  __IO uint32_t SBUF02;            /*!< SMIF Indirect Access Secondary Buffer Register 02*/
  __IO uint32_t SBUF03;            /*!< SMIF Indirect Access Secondary Buffer Register 03*/
  __IO uint32_t SBUF04;            /*!< SMIF Indirect Access Secondary Buffer Register 04*/
  __IO uint32_t SBUF05;            /*!< SMIF Indirect Access Secondary Buffer Register 05*/
  __IO uint32_t SBUF06;            /*!< SMIF Indirect Access Secondary Buffer Register 06*/
  __IO uint32_t SBUF07;            /*!< SMIF Indirect Access Secondary Buffer Register 07*/
  __IO uint32_t SBUF08;            /*!< SMIF Indirect Access Secondary Buffer Register 08*/
  __IO uint32_t SBUF09;            /*!< SMIF Indirect Access Secondary Buffer Register 09*/
  __IO uint32_t SBUF10;            /*!< SMIF Indirect Access Secondary Buffer Register 10*/
  __IO uint32_t SBUF11;            /*!< SMIF Indirect Access Secondary Buffer Register 11*/
  __IO uint32_t SBUF12;            /*!< SMIF Indirect Access Secondary Buffer Register 12*/
  __IO uint32_t SBUF13;            /*!< SMIF Indirect Access Secondary Buffer Register 13*/
  __IO uint32_t SBUF14;            /*!< SMIF Indirect Access Secondary Buffer Register 14*/
  __IO uint32_t SBUF15;            /*!< SMIF Indirect Access Secondary Buffer Register 15*/
  __IO uint32_t SBUF16;            /*!< SMIF Indirect Access Secondary Buffer Register 16*/
  __IO uint32_t SBUF17;            /*!< SMIF Indirect Access Secondary Buffer Register 17*/
  __IO uint32_t SBUF18;            /*!< SMIF Indirect Access Secondary Buffer Register 18*/
  __IO uint32_t SBUF19;            /*!< SMIF Indirect Access Secondary Buffer Register 19*/
  __IO uint32_t SBUF20;            /*!< SMIF Indirect Access Secondary Buffer Register 20*/
  __IO uint32_t SBUF21;            /*!< SMIF Indirect Access Secondary Buffer Register 21*/
  __IO uint32_t SBUF22;            /*!< SMIF Indirect Access Secondary Buffer Register 22*/
  __IO uint32_t SBUF23;            /*!< SMIF Indirect Access Secondary Buffer Register 23*/
  __IO uint32_t SBUF24;            /*!< SMIF Indirect Access Secondary Buffer Register 24*/
  __IO uint32_t SBUF25;            /*!< SMIF Indirect Access Secondary Buffer Register 25*/
  __IO uint32_t SBUF26;            /*!< SMIF Indirect Access Secondary Buffer Register 26*/
  __IO uint32_t SBUF27;            /*!< SMIF Indirect Access Secondary Buffer Register 27*/
  __IO uint32_t SBUF28;            /*!< SMIF Indirect Access Secondary Buffer Register 28*/
  __IO uint32_t SBUF29;            /*!< SMIF Indirect Access Secondary Buffer Register 29*/
  __IO uint32_t SBUF30;            /*!< SMIF Indirect Access Secondary Buffer Register 30*/
  __IO uint32_t SBUF31;            /*!< SMIF Indirect Access Secondary Buffer Register 31*/
  __IO uint32_t SBUF32;            /*!< SMIF Indirect Access Secondary Buffer Register 32*/
  __IO uint32_t SBUF33;            /*!< SMIF Indirect Access Secondary Buffer Register 33*/
  __IO uint32_t SBUF34;            /*!< SMIF Indirect Access Secondary Buffer Register 34*/
  __IO uint32_t SBUF35;            /*!< SMIF Indirect Access Secondary Buffer Register 35*/
  __IO uint32_t SBUF36;            /*!< SMIF Indirect Access Secondary Buffer Register 36*/
  __IO uint32_t SBUF37;            /*!< SMIF Indirect Access Secondary Buffer Register 37*/
  __IO uint32_t SBUF38;            /*!< SMIF Indirect Access Secondary Buffer Register 38*/
  __IO uint32_t SBUF39;            /*!< SMIF Indirect Access Secondary Buffer Register 39*/
  __IO uint32_t SBUF40;            /*!< SMIF Indirect Access Secondary Buffer Register 40*/
  __IO uint32_t SBUF41;            /*!< SMIF Indirect Access Secondary Buffer Register 41*/
  __IO uint32_t SBUF42;            /*!< SMIF Indirect Access Secondary Buffer Register 42*/
  __IO uint32_t SBUF43;            /*!< SMIF Indirect Access Secondary Buffer Register 43*/
  __IO uint32_t SBUF44;            /*!< SMIF Indirect Access Secondary Buffer Register 44*/
  __IO uint32_t SBUF45;            /*!< SMIF Indirect Access Secondary Buffer Register 45*/
  __IO uint32_t SBUF46;            /*!< SMIF Indirect Access Secondary Buffer Register 46*/
  __IO uint32_t SBUF47;            /*!< SMIF Indirect Access Secondary Buffer Register 47*/
  __IO uint32_t SBUF48;            /*!< SMIF Indirect Access Secondary Buffer Register 48*/
  __IO uint32_t SBUF49;            /*!< SMIF Indirect Access Secondary Buffer Register 49*/
  __IO uint32_t SBUF50;            /*!< SMIF Indirect Access Secondary Buffer Register 50*/
  __IO uint32_t SBUF51;            /*!< SMIF Indirect Access Secondary Buffer Register 51*/
  __IO uint32_t SBUF52;            /*!< SMIF Indirect Access Secondary Buffer Register 52*/
  __IO uint32_t SBUF53;            /*!< SMIF Indirect Access Secondary Buffer Register 53*/
  __IO uint32_t SBUF54;            /*!< SMIF Indirect Access Secondary Buffer Register 54*/
  __IO uint32_t SBUF55;            /*!< SMIF Indirect Access Secondary Buffer Register 55*/
  __IO uint32_t SBUF56;            /*!< SMIF Indirect Access Secondary Buffer Register 56*/
  __IO uint32_t SBUF57;            /*!< SMIF Indirect Access Secondary Buffer Register 57*/
  __IO uint32_t SBUF58;            /*!< SMIF Indirect Access Secondary Buffer Register 58*/
  __IO uint32_t SBUF59;            /*!< SMIF Indirect Access Secondary Buffer Register 59*/
  __IO uint32_t SBUF60;            /*!< SMIF Indirect Access Secondary Buffer Register 60*/
  __IO uint32_t SBUF61;            /*!< SMIF Indirect Access Secondary Buffer Register 61*/
  __IO uint32_t SBUF62;            /*!< SMIF Indirect Access Secondary Buffer Register 62*/
  __IO uint32_t SBUF63;            /*!< SMIF Indirect Access Secondary Buffer Register 63*/
} TSB_SMI_TypeDef;

/**
  * @brief Interrupt Control Registers A
  */
typedef struct
{
  __IO uint8_t  NIC00;             /*!< Non-maskable Interrupt A Control Register 00 */
       uint8_t  RESERVED0[31];
  __IO uint8_t  IMC00;             /*!< Interrupt A Mode Control Register 00         */
  __IO uint8_t  IMC01;             /*!< Interrupt A Mode Control Register 01         */
  __IO uint8_t  IMC02;             /*!< Interrupt A Mode Control Register 02         */
  __IO uint8_t  IMC03;             /*!< Interrupt A Mode Control Register 03         */
  __IO uint8_t  IMC04;             /*!< Interrupt A Mode Control Register 04         */
  __IO uint8_t  IMC05;             /*!< Interrupt A Mode Control Register 05         */
  __IO uint8_t  IMC06;             /*!< Interrupt A Mode Control Register 06         */
  __IO uint8_t  IMC07;             /*!< Interrupt A Mode Control Register 07         */
  __IO uint8_t  IMC08;             /*!< Interrupt A Mode Control Register 08         */
  __IO uint8_t  IMC09;             /*!< Interrupt A Mode Control Register 09         */
  __IO uint8_t  IMC10;             /*!< Interrupt A Mode Control Register 10         */
  __IO uint8_t  IMC11;             /*!< Interrupt A Mode Control Register 11         */
  __IO uint8_t  IMC12;             /*!< Interrupt A Mode Control Register 12         */
  __IO uint8_t  IMC13;             /*!< Interrupt A Mode Control Register 13         */
  __IO uint8_t  IMC14;             /*!< Interrupt A Mode Control Register 14         */
  __IO uint8_t  IMC15;             /*!< Interrupt A Mode Control Register 15         */
  __IO uint8_t  IMC16;             /*!< Interrupt A Mode Control Register 16         */
  __IO uint8_t  IMC17;             /*!< Interrupt A Mode Control Register 17         */
  __IO uint8_t  IMC18;             /*!< Interrupt A Mode Control Register 18         */
  __IO uint8_t  IMC19;             /*!< Interrupt A Mode Control Register 19         */
  __IO uint8_t  IMC20;             /*!< Interrupt A Mode Control Register 20         */
  __IO uint8_t  IMC21;             /*!< Interrupt A Mode Control Register 21         */
  __IO uint8_t  IMC22;             /*!< Interrupt A Mode Control Register 22         */
  __IO uint8_t  IMC23;             /*!< Interrupt A Mode Control Register 23         */
  __IO uint8_t  IMC24;             /*!< Interrupt A Mode Control Register 24         */
  __IO uint8_t  IMC25;             /*!< Interrupt A Mode Control Register 25         */
  __IO uint8_t  IMC26;             /*!< Interrupt A Mode Control Register 26         */
  __IO uint8_t  IMC27;             /*!< Interrupt A Mode Control Register 27         */
  __IO uint8_t  IMC28;             /*!< Interrupt A Mode Control Register 28         */
  __IO uint8_t  IMC29;             /*!< Interrupt A Mode Control Register 29         */
  __IO uint8_t  IMC30;             /*!< Interrupt A Mode Control Register 30         */
  __IO uint8_t  IMC31;             /*!< Interrupt A Mode Control Register 31         */
       uint8_t  RESERVED1[17];
  __IO uint8_t  IMC49;             /*!< Interrupt A Mode Control Register 49         */
  __IO uint8_t  IMC50;             /*!< Interrupt A Mode Control Register 50         */
  __IO uint8_t  IMC51;             /*!< Interrupt A Mode Control Register 51         */
  __IO uint8_t  IMC52;             /*!< Interrupt A Mode Control Register 52         */
  __IO uint8_t  IMC53;             /*!< Interrupt A Mode Control Register 53         */
       uint8_t  RESERVED2;
  __IO uint8_t  IMC55;             /*!< Interrupt A Mode Control Register 55         */
  __IO uint8_t  IMC56;             /*!< Interrupt A Mode Control Register 56         */
  __IO uint8_t  IMC57;             /*!< Interrupt A Mode Control Register 57         */
} TSB_IA_TypeDef;

/**
  * @brief Low speed oscillation/power control/reset
  */
typedef struct
{
  __IO uint8_t  LOSCCR;            /*!< Low speed oscillation and Internal High speed oscillation 2 clock control register*/
  __IO uint8_t  SHTDNOP;           /*!< Power supply cut off control register        */
  __IO uint8_t  RSTFLG0;           /*!< Reset flag register 0                        */
  __IO uint8_t  RSTFLG1;           /*!< Reset flag register 1                        */
       uint8_t  RESERVED0[11];
  __IO uint8_t  PROTECT;           /*!< RLM write protection register                */
} TSB_RLM_TypeDef;

/**
  * @brief LVD0
  */
typedef struct
{
  __IO uint8_t  CR1;               /*!< LVD Control Register1                        */
  __IO uint8_t  CR2;               /*!< LVD Control Register2                        */
  __IO uint8_t  LVL1;              /*!< LVD Detection Voltage Select Register 1      */
       uint8_t  RESERVED0;
  __I  uint8_t  SR;                /*!< LVD Status Register                          */
} TSB_LVD_TypeDef;

/**
  * @brief TRGSEL
  */
typedef struct
{
  __IO uint32_t CR0;               /*!< TRGSEL Control register 0                    */
  __IO uint32_t CR1;               /*!< TRGSEL Control register 1                    */
  __IO uint32_t CR2;               /*!< TSEL Control register 2                      */
  __IO uint32_t CR3;               /*!< TRGSEL Control register 3                    */
  __IO uint32_t CR4;               /*!< TRGSEL Control register 4                    */
  __IO uint32_t CR5;               /*!< TRGSEL Control register 5                    */
  __IO uint32_t CR6;               /*!< TRGSEL Control register 6                    */
  __IO uint32_t CR7;               /*!< TRGSEL Control register 7                    */
  __IO uint32_t CR8;               /*!< TRGSEL Control register 8                    */
  __IO uint32_t CR9;               /*!< TRGSEL Control register 9                    */
  __IO uint32_t CR10;              /*!< TRGSEL Control register 10                   */
  __IO uint32_t CR11;              /*!< TRGSEL Control register 11                   */
  __IO uint32_t CR12;              /*!< TRGSEL Control register 12                   */
  __IO uint32_t CR13;              /*!< TRGSEL Control register 13                   */
  __IO uint32_t CR14;              /*!< TRGSEL Control register 14                   */
} TSB_TSEL_TypeDef;

/**
  * @brief Long Term Timer(LTTMR)
  */
typedef struct
{
  __IO uint8_t  CR0;               /*!< LTTMR Control Register                       */
  __IO uint8_t  VALL;              /*!< LTTMR Data Register (Lower)                  */
  __IO uint8_t  VALH;              /*!< LTTMR Data Register (Upper)                  */
} TSB_LTT_TypeDef;

/**
  * @brief Serial Interface (TSPI)
  */
typedef struct
{
  __IO uint32_t CR0;               /*!< TSPI Control Register 0                      */
  __IO uint32_t CR1;               /*!< TSPI Control Register 1                      */
  __IO uint32_t CR2;               /*!< TSPI Control Register 2                      */
  __IO uint32_t CR3;               /*!< TSPI Control Register 3                      */
  __IO uint32_t BR;                /*!< TSPI Baud Rate Register                      */
  __IO uint32_t FMTR0;             /*!< TSPI Format Control Register 0               */
  __IO uint32_t FMTR1;             /*!< TSPI Format Control Register 1               */
  __IO uint32_t SECTCR0;           /*!< TSPI Sector mode Control Register 0          */
  __IO uint32_t SECTCR1;           /*!< TSPI Sector mode Control Register 1          */
       uint32_t RESERVED0[55];
  __IO uint32_t DR;                /*!< TSPI Data Register                           */
       uint32_t RESERVED1[63];
  __IO uint32_t SR;                /*!< TSPI Status Register                         */
  __IO uint32_t ERR;               /*!< TSPI Error Flag Register                     */
} TSB_TSPI_TypeDef;

/**
  * @brief External Bus Interface(EXB)
  */
typedef struct
{
  __IO uint32_t MOD;               /*!< EBIF Mode Control Register                   */
       uint32_t RESERVED0[3];
  __IO uint32_t AS0;               /*!< EBIF Area and Start Address Configuration Register 0*/
  __IO uint32_t AS1;               /*!< EBIF Area and Start Address Configuration Register 1*/
  __IO uint32_t AS2;               /*!< EBIF Area and Start Address Configuration Register 2*/
  __IO uint32_t AS3;               /*!< EBIF Area and Start Address Configuration Register 3*/
       uint32_t RESERVED1[8];
  __IO uint32_t CS0;               /*!< EBIF Chip Select Control Register 0          */
  __IO uint32_t CS1;               /*!< EBIF Chip Select Control Register 1          */
  __IO uint32_t CS2;               /*!< EBIF Chip Select Control Register 2          */
  __IO uint32_t CS3;               /*!< EBIF Chip Select Control Register 3          */
       uint32_t RESERVED2[4];
  __IO uint32_t CLKCTL;            /*!< EBIF Clock Output Control Register           */
} TSB_EXB_TypeDef;

/**
  * @brief Clock Generator (CG)
  */
typedef struct
{
  __IO uint32_t PROTECT;           /*!< CG write protection register                 */
  __IO uint32_t OSCCR;             /*!< CG Oscillation control register              */
  __IO uint32_t SYSCR;             /*!< CG System clock control register             */
  __IO uint32_t STBYCR;            /*!< CG Standby control register                  */
       uint32_t RESERVED0[4];
  __IO uint32_t PLL0SEL;           /*!< CG PLL selection register for fsys           */
       uint32_t RESERVED1[3];
  __IO uint32_t WUPHCR;            /*!< CG High speed oscillation warming up register*/
  __IO uint32_t WUPLCR;            /*!< CG Low speed oscillation warming up register */
       uint32_t RESERVED2[3];
  __IO uint32_t FSYSMENC;          /*!< CG Middle speed clock supply and stop register C for fsys*/
  __IO uint32_t FSYSMENA;          /*!< CG Middle speed clock supply and stop register A for fsys*/
  __IO uint32_t FSYSMENB;          /*!< CG Middle speed clock supply and stop register B for fsys*/
  __IO uint32_t FSYSENA;           /*!< CG High speed clock supply and stop register A for fsys*/
       uint32_t RESERVED3;
  __IO uint32_t FCEN;              /*!< CG Clock supply and stop register for fc     */
  __IO uint32_t SPCLKEN;           /*!< CG Clock supply for ADC and Trace Register   */
       uint32_t RESERVED4[2];
  __IO uint32_t EXTEND2;           /*!< CG Function extension register 2             */
} TSB_CG_TypeDef;

