iarsystems/ewarm-toshiba-example-projects/TMPM4GQ/Libraries/TMPM4GQ.h
#define TSB_UART4_SWRST_SWRSTF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART4->SWRST,7)))
#define TSB_UART4_CR0_PE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR0,2)))
#define TSB_UART4_CR0_EVEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR0,3)))
#define TSB_UART4_CR0_SBLEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR0,4)))
#define TSB_UART4_CR0_DIR                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR0,5)))
#define TSB_UART4_CR0_IV                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR0,6)))
#define TSB_UART4_CR0_WU                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR0,8)))
#define TSB_UART4_CR0_RTSE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR0,9)))
#define TSB_UART4_CR0_CTSE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR0,10)))
#define TSB_UART4_CR0_LPB                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR0,15)))
#define TSB_UART4_CR0_HBSEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR0,16)))
#define TSB_UART4_CR0_HBSMD                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR0,17)))
#define TSB_UART4_CR0_HBSST                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR0,18)))
#define TSB_UART4_CR1_DMARE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR1,0)))
#define TSB_UART4_CR1_DMATE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR1,1)))
#define TSB_UART4_CR1_INTERR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR1,2)))
#define TSB_UART4_CR1_INTRXWE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR1,4)))
#define TSB_UART4_CR1_INTRXFE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR1,5)))
#define TSB_UART4_CR1_INTTXWE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR1,6)))
#define TSB_UART4_CR1_INTTXFE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->CR1,7)))
#define TSB_UART4_BRD_KEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->BRD,23)))
#define TSB_UART4_TRANS_RXE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->TRANS,0)))
#define TSB_UART4_TRANS_TXE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->TRANS,1)))
#define TSB_UART4_TRANS_TXTRG                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->TRANS,2)))
#define TSB_UART4_TRANS_BK                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->TRANS,3)))
#define TSB_UART4_DR_BERR                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART4->DR,16)))
#define TSB_UART4_DR_FERR                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART4->DR,17)))
#define TSB_UART4_DR_PERR                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART4->DR,18)))
#define TSB_UART4_SR_RXFF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->SR,5)))
#define TSB_UART4_SR_RXEND                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->SR,6)))
#define TSB_UART4_SR_RXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART4->SR,7)))
#define TSB_UART4_SR_TXFF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->SR,13)))
#define TSB_UART4_SR_TXEND                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->SR,14)))
#define TSB_UART4_SR_TXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART4->SR,15)))
#define TSB_UART4_SR_SUE                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART4->SR,31)))
#define TSB_UART4_FIFOCLR_RFCLR                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART4->FIFOCLR,0)))
#define TSB_UART4_FIFOCLR_TFCLR                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART4->FIFOCLR,1)))
#define TSB_UART4_ERR_BERR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->ERR,0)))
#define TSB_UART4_ERR_FERR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->ERR,1)))
#define TSB_UART4_ERR_PERR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->ERR,2)))
#define TSB_UART4_ERR_OVRERR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->ERR,3)))
#define TSB_UART4_ERR_TRGERR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART4->ERR,4)))

#define TSB_UART5_SWRST_SWRSTF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART5->SWRST,7)))
#define TSB_UART5_CR0_PE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,2)))
#define TSB_UART5_CR0_EVEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,3)))
#define TSB_UART5_CR0_SBLEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,4)))
#define TSB_UART5_CR0_DIR                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,5)))
#define TSB_UART5_CR0_IV                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,6)))
#define TSB_UART5_CR0_WU                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,8)))
#define TSB_UART5_CR0_RTSE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,9)))
#define TSB_UART5_CR0_CTSE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,10)))
#define TSB_UART5_CR0_LPB                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,15)))
#define TSB_UART5_CR0_HBSEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,16)))
#define TSB_UART5_CR0_HBSMD                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,17)))
#define TSB_UART5_CR0_HBSST                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,18)))
#define TSB_UART5_CR1_DMARE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR1,0)))
#define TSB_UART5_CR1_DMATE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR1,1)))
#define TSB_UART5_CR1_INTERR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR1,2)))
#define TSB_UART5_CR1_INTRXWE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR1,4)))
#define TSB_UART5_CR1_INTRXFE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR1,5)))
#define TSB_UART5_CR1_INTTXWE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR1,6)))
#define TSB_UART5_CR1_INTTXFE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR1,7)))
#define TSB_UART5_BRD_KEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->BRD,23)))
#define TSB_UART5_TRANS_RXE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->TRANS,0)))
#define TSB_UART5_TRANS_TXE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->TRANS,1)))
#define TSB_UART5_TRANS_TXTRG                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->TRANS,2)))
#define TSB_UART5_TRANS_BK                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->TRANS,3)))
#define TSB_UART5_DR_BERR                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART5->DR,16)))
#define TSB_UART5_DR_FERR                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART5->DR,17)))
#define TSB_UART5_DR_PERR                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART5->DR,18)))
#define TSB_UART5_SR_RXFF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->SR,5)))
#define TSB_UART5_SR_RXEND                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->SR,6)))
#define TSB_UART5_SR_RXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART5->SR,7)))
#define TSB_UART5_SR_TXFF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->SR,13)))
#define TSB_UART5_SR_TXEND                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->SR,14)))
#define TSB_UART5_SR_TXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART5->SR,15)))
#define TSB_UART5_SR_SUE                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART5->SR,31)))
#define TSB_UART5_FIFOCLR_RFCLR                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART5->FIFOCLR,0)))
#define TSB_UART5_FIFOCLR_TFCLR                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART5->FIFOCLR,1)))
#define TSB_UART5_ERR_BERR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->ERR,0)))
#define TSB_UART5_ERR_FERR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->ERR,1)))
#define TSB_UART5_ERR_PERR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->ERR,2)))
#define TSB_UART5_ERR_OVRERR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->ERR,3)))
#define TSB_UART5_ERR_TRGERR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->ERR,4)))


/* I2S interface */
#define TSB_I2S0_CSTART_START                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->CSTART,8)))
#define TSB_I2S0_CBUSY_BUSY                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->CBUSY,8)))
#define TSB_I2S0_CSTOP_I2S_STOP                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->CSTOP,0)))
#define TSB_I2S0_CAUDIOSET_SCLKTOWS               (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->CAUDIOSET,8)))
#define TSB_I2S0_CAUDIOSET_EDGE                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->CAUDIOSET,11)))
#define TSB_I2S0_CREGBUSY_AUDIOSETBUSY            (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->CREGBUSY,0)))
#define TSB_I2S0_CREGBUSY_MODESETBUSY             (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->CREGBUSY,3)))
#define TSB_I2S0_CREGBUSY_AUDIOSETPEND            (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->CREGBUSY,16)))
#define TSB_I2S0_CREGBUSY_MODESETPEND             (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->CREGBUSY,19)))
#define TSB_I2S0_CMS_SEL_SEL                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->CMS_SEL,0)))
#define TSB_I2S0_CMCLK_IO_SEL_SEL                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->CMCLK_IO_SEL,0)))
#define TSB_I2S0_CPHT_DIVOUT_EN_EN                (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->CPHT_DIVOUT_EN,0)))
#define TSB_I2S0_CBCK_SRC_SEL_SEL                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->CBCK_SRC_SEL,0)))
#define TSB_I2S0_CBCK_DIVOUT_EN_EN                (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->CBCK_DIVOUT_EN,0)))
#define TSB_I2S0_ISTART_MICSTART                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->ISTART,0)))
#define TSB_I2S0_ISTART_START                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->ISTART,8)))
#define TSB_I2S0_IBUSY_MICBUSY                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->IBUSY,0)))
#define TSB_I2S0_IBUSY_SERIBUSY                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->IBUSY,1)))
#define TSB_I2S0_IBUSY_ERRBUSY                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->IBUSY,16)))
#define TSB_I2S0_IBUSY_LRERRBUSY                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->IBUSY,17)))
#define TSB_I2S0_ISTOP_I2S_STOP                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->ISTOP,0)))
#define TSB_I2S0_IAUDIOSET_SCLKTOWS               (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->IAUDIOSET,8)))
#define TSB_I2S0_IAUDIOSET_EDGE                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->IAUDIOSET,11)))
#define TSB_I2S0_IAUDIOSET_SDEDGE                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->IAUDIOSET,12)))
#define TSB_I2S0_IAUDIOSET_DTFMT                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->IAUDIOSET,16)))
#define TSB_I2S0_IINTSTAT_INT                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->IINTSTAT,0)))
#define TSB_I2S0_IINTSTAT_ORERR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->IINTSTAT,1)))
#define TSB_I2S0_IINTSTAT_URERR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->IINTSTAT,2)))
#define TSB_I2S0_IINTSTAT_LRCKERR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->IINTSTAT,3)))
#define TSB_I2S0_IINTMASK_MASK                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->IINTMASK,0)))
#define TSB_I2S0_IINTMASK_ORMASK                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->IINTMASK,1)))
#define TSB_I2S0_IINTMASK_URMASK                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->IINTMASK,2)))
#define TSB_I2S0_IINTMASK_LRERRMASK               (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->IINTMASK,3)))
#define TSB_I2S0_IINTMASK_DMACMSK                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->IINTMASK,16)))
#define TSB_I2S0_IINTCLR_INTCLR                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_I2S0->IINTCLR,0)))
#define TSB_I2S0_IINTCLR_ORCLR                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_I2S0->IINTCLR,1)))
#define TSB_I2S0_IINTCLR_URCLR                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_I2S0->IINTCLR,2)))
#define TSB_I2S0_IINTCLR_LRERRCLR                 (*((__O  uint32_t *)BITBAND_PERI(&TSB_I2S0->IINTCLR,3)))
#define TSB_I2S0_IMUTE_MUTEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->IMUTE,0)))
#define TSB_I2S0_IREGBUSY_AUDIOSETBUSY            (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->IREGBUSY,0)))
#define TSB_I2S0_IREGBUSY_MUTEBUSY                (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->IREGBUSY,1)))
#define TSB_I2S0_IREGBUSY_MODESETBUSY             (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->IREGBUSY,3)))
#define TSB_I2S0_IREGBUSY_AUDIOSETPEND            (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->IREGBUSY,16)))
#define TSB_I2S0_IREGBUSY_MUTEPEND                (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->IREGBUSY,17)))
#define TSB_I2S0_IREGBUSY_MODESETPEND             (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->IREGBUSY,19)))
#define TSB_I2S0_OSTART_SPKSTART                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->OSTART,0)))
#define TSB_I2S0_OSTART_START                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->OSTART,8)))
#define TSB_I2S0_OBUSY_SPKBUSY                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->OBUSY,0)))
#define TSB_I2S0_OBUSY_SERIBUSY                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->OBUSY,1)))
#define TSB_I2S0_OBUSY_ERRBUSY                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->OBUSY,16)))
#define TSB_I2S0_OBUSY_LRERRBUSY                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->OBUSY,17)))
#define TSB_I2S0_OSTOP_I2S_STOP                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->OSTOP,0)))
#define TSB_I2S0_OAUDIOSET_SCLKTOWS               (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->OAUDIOSET,8)))
#define TSB_I2S0_OAUDIOSET_EDGE                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->OAUDIOSET,11)))
#define TSB_I2S0_OAUDIOSET_SDEDGE                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->OAUDIOSET,12)))
#define TSB_I2S0_OAUDIOSET_DTFMT                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->OAUDIOSET,16)))
#define TSB_I2S0_OINTSTAT_INT                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->OINTSTAT,0)))
#define TSB_I2S0_OINTSTAT_ORERR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->OINTSTAT,1)))
#define TSB_I2S0_OINTSTAT_URERR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->OINTSTAT,2)))
#define TSB_I2S0_OINTSTAT_LRCKERR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->OINTSTAT,3)))
#define TSB_I2S0_OINTMASK_MASK                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->OINTMASK,0)))
#define TSB_I2S0_OINTMASK_ORMASK                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->OINTMASK,1)))
#define TSB_I2S0_OINTMASK_URMASK                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->OINTMASK,2)))
#define TSB_I2S0_OINTMASK_LRERRMASK               (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->OINTMASK,3)))
#define TSB_I2S0_OINTMASK_DMACMSK                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->OINTMASK,16)))
#define TSB_I2S0_OINTCLR_INTCLR                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_I2S0->OINTCLR,0)))
#define TSB_I2S0_OINTCLR_ORCLR                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_I2S0->OINTCLR,1)))
#define TSB_I2S0_OINTCLR_URCLR                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_I2S0->OINTCLR,2)))
#define TSB_I2S0_OINTCLR_LRERRCLR                 (*((__O  uint32_t *)BITBAND_PERI(&TSB_I2S0->OINTCLR,3)))
#define TSB_I2S0_OMUTE_MUTEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_I2S0->OMUTE,0)))
#define TSB_I2S0_OREGBUSY_AUDIOSETBUSY            (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->OREGBUSY,0)))
#define TSB_I2S0_OREGBUSY_MUTEBUSY                (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->OREGBUSY,1)))
#define TSB_I2S0_OREGBUSY_TXSSIZEBUSY             (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->OREGBUSY,2)))
#define TSB_I2S0_OREGBUSY_MODESETBUSY             (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->OREGBUSY,3)))
#define TSB_I2S0_OREGBUSY_AUDIOSETPEND            (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->OREGBUSY,16)))
#define TSB_I2S0_OREGBUSY_MUTEPEND                (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->OREGBUSY,17)))
#define TSB_I2S0_OREGBUSY_TXSSIZEPEND             (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->OREGBUSY,18)))
#define TSB_I2S0_OREGBUSY_MODESETPEND             (*((__I  uint32_t *)BITBAND_PERI(&TSB_I2S0->OREGBUSY,19)))

